app/controllers/eventos_controller.rb

  def show
    @tipo_eventos = TipoEvento.all
    @pessoas = Pessoa.all
---
SELECT "pessoas".* FROM "pessoas"

  def new
    @evento = Evento.new
    @tipo_evento = TipoEvento.all
---
SELECT "tipo_eventos".* FROM "tipo_eventos"

  def create
    @evento = Evento.new(evento_params)

    respond_to do |format|
      if @evento.save
---
INSERT INTO "eventos" ("data", "descricao", "created_at", "updated_at", "tipo_eventos_id") VALUES (?, ?, ?, ?, ?)  [["data", "2021-08-28 00:13:00"], ["descricao", "teste"], ["created_at", "2021-08-28 00:13:23.114134"], ["updated_at", "2021-08-28 00:13:23.114134"], ["tipo_eventos_id", 1]]

  def destroy
    @evento.destroy
---
DELETE FROM "eventos" WHERE "eventos"."id" = ?  [["id", 1]]