app/controllers/frequencia_eventos_controller.rb

  def index
    @frequencia_eventos = FrequenciaEvento.all
---
SELECT "frequencia_eventos".* FROM "frequencia_eventos"

  def new
    @frequencia_evento = FrequenciaEvento.new
    @pessoas = Pessoa.all
---
SELECT "pessoas".* FROM "pessoas"

  def create
    @frequencia_evento = FrequenciaEvento.new(frequencia_evento_params)

    respond_to do |format|
      if @frequencia_evento.save
---
INSERT INTO "frequencia_eventos" ("status", "created_at", "updated_at") VALUES (?, ?, ?)  [["status", ""], ["created_at", "2021-09-19 16:07:25.493750"], ["updated_at", "2021-09-19 16:07:25.493750"]]