app/controllers/pessoas_controller.rb

  def create
    @pessoa = Pessoa.new(pessoa_params)

    respond_to do |format|
      if @pessoa.save
---
INSERT INTO "pessoas" ("tipo", "cargo", "depto", "created_at", "updated_at", "nome") VALUES (?, ?, ?, ?, ?, ?)  [["tipo", "membro"], ["cargo", "colab"], ["depto", "adultos"], ["created_at", "2021-08-23 22:31:50.900565"], ["updated_at", "2021-08-23 22:31:50.900565"], ["nome", "Juan"]]

  def update
    respond_to do |format|
      if @pessoa.update(pessoa_params)
---
UPDATE "pessoas" SET "tipo" = ?, "updated_at" = ? WHERE "pessoas"."id" = ?  [["tipo", "membro2"], ["updated_at", "2021-12-15 02:09:24.409458"], ["id", 1]]

  def destroy
    @pessoa.destroy
---
DELETE FROM "pessoas" WHERE "pessoas"."id" = ?  [["id", 1]]