app/controllers/tipo_eventos_controller.rb

SELECT "tipo_eventos".* FROM "tipo_eventos"
---
  def index
    @tipo_eventos = TipoEvento.all

INSERT INTO "tipo_eventos" ("tipo", "created_at", "updated_at") VALUES (?, ?, ?)  [["tipo", "Domingo"], ["created_at", "2021-08-23 22:34:52.130221"], ["updated_at", "2021-08-23 22:34:52.130221"]]
---
  def create
    @tipo_evento = TipoEvento.new(tipo_evento_params)

    respond_to do |format|
      if @tipo_evento.save

SELECT "tipo_eventos".* FROM "tipo_eventos" WHERE "tipo_eventos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tipo_evento
      @tipo_evento = TipoEvento.find(params[:id])